{
  "about.title": "About me",
  "about.mainmsg1": "Hello, My name is ",
  "about.mainmsg2": " and I am a web developer focused on Front-end. ",
  "about.mainmsg3": "I am an Engineer graduated from ",
  "about.mainmsg4": "Technological Institute of Ciudad Juaréz (TecNM)",
  "about.mainmsg5": ", I successfully completed the career of ",
  "about.mainmsg6": "Computer Systems Engineering, taking the specialty of Advanced Software Development",
  "about.mainmsg7": ", I am very excited to be able to work with recent technologies that allow to improve processes and help the development of complete and robust software, I specialize in ",
  "about.mainmsg8": " web development with ReactJS and TailwindCSS, however I also have some basic technical knowledge of ",
  "about.mainmsg9": ", for example NodeJS, I also have some knowledge of mobile development thanks to technologies such as React Native.",
  "about.mainmsg10": "I consider myself a highly responsible person who always tries to prioritize the quality of his work even when I do not know 100% the technology that is asked of me, I do my best to reach my own quality standards and those that are proposed to me later.",
  "about.mainmsg11": "Regarding my hobbies, I really like to play video games, especially those that require a considerable amount of strategy, I also like to investigate current and relevant issues, both scientific and technological issues, I really like to keep up to date with this type of thing since that gives me motivation to continue acquiring knowledge and not miss out on interesting news, at the same time I like to share each new knowledge that I acquire and internalize with others.",
  "about.mainmsg12": "Regarding my level of English, I obtained a score of B2 by TOEFL ITP, this score was achieved in 2018 and since then I have continued to improve my English skills on my own to strengthen myself in the language. ",

  "about.DataListTitle1": "My data",
  "about.DataList1st1": "Age: ",
  "about.DataList1st2": " Years",
  "about.DataList2nd": "Studies: Engineering",
  "about.DataList3rd": "Freelance: Available",
  "about.DataList4th1": "Personal blog: ",
  "about.DataList4th2": "Go to blog (Available only in spanish)",
  "about.DataList5th": "City: Juarez, Chihuahua. MX",
  "about.DataList6th": "Phone: 656-393-1234",
  "about.DataList7th": "E-mail: Chaotears@gmail.com",
  "about.DataListTitle2": "Languages",
  "about.DataList8th": "Spanish (Native)",
  "about.DataList9th": "English (Intermediate B2) ",
  "about.DataListTitle3": "Technologies I use: ",
  "about.DataListTitle4": "Technologies I'm learning: ",

  "about.download": "Download here",

  "about.title2": "Summary",
  "about.title2.1": "Education ",
  "about.title2.2": "Work experience ",

  "about.TitleEducation1": "Computer Systems Engineer ",
  "about.DateEducation1": "2015-2020 ",
  "about.PlaceEducation1": "Technological Institute of Ciudad Juárez ",
  "about.DescriptionEducation1": "I studied my career for 5 years, where due to pandemic complications it was difficult for me to finish the process until almost 1 year later (2021), while studying the degree I learned the incredible importance of the fundamentals of any software process, learning to be self-taught and to communicate and transmit my ideas towards my colleagues to be able to work as a team so that the project continues its progress. ",
  "about.AboutEducation1": " ",

  "about.TitleEducation2": "Online courses ",
  "about.DateEducation2": "2019 - Present ",
  "about.PlaceEducation2": "Udemy - Platzi - Others ",
  "about.DescriptionEducation2": "Before finishing my degree I realized that the career alone was not enough for what I wanted to dedicate myself, therefore I decided to invest more in my education, it was there when I began to follow online courses of all kinds that would help my personal growth, thanks to the courses of the platforms I got the knowledge of other people and adapted it to myself, I use it in my own way and I make sure to continue evolving the knowledge that other people transmitted to me.",
  "about.AboutEducation2": " ",

  "about.TitleExperience1": "Mobile app developer",
  "about.DateExperience1": "2019-2020 (6 months)",
  "about.PlaceExperience1": "MABU - Ciudad Juaréz, Chih. MX ",
  "about.DescriptionExperience1": "I was the main programmer of the Casas de Cambio Jrz application, I did the full stack programming of it in the React Native framework and Firebase, I developed the tools for direct communication with the exchange houses to be able to add them to the application and I was monitoring the performance of the application during the firsts weeks of its deployment.",
  "about.AboutExperience1": " ",

  "about.TitleExperience2": "Software Engineer | Frontend",
  "about.DateExperience2": "2021 - 2022 (1 year)",
  "about.PlaceExperience2": "Houm - Remote",
  "about.DescriptionExperience2": "I worked as a frontend software engineer, using React with TypeScript along with Material UI, developed multiple views for the company's internal system, such as visualization of tables, agendas, forms and maps, also wrote quality code and developed reusable components, automated tests with Cypress, to ensure the functionality of the development.",
  "about.AboutExperience2": " "
}
