{
  "about.title": "Sobre mí",
  "about.mainmsg1": "Hola, mi nombre es ",
  "about.mainmsg2": " y soy desarrollador web enfocado al Front-end. ",
  "about.mainmsg3": "Soy Ingeniero egresado del ",
  "about.mainmsg4": "Instituto Tecnológico de Ciudad Juaréz (TecNM)",
  "about.mainmsg5": ", concluí con éxito la carrera de ",
  "about.mainmsg6": "Ingeniería en Sistemas computacionales, tomando la especialidad de Desarrollo de software avanzado",
  "about.mainmsg7": ", me entusiasma mucho poder trabajar con tecnologías recientes que permitan mejorar los procesos y ayuden al desarrollo de software completo y robusto, me especializo en el desarrollo web  ",
  "about.mainmsg8": " con ReactJS y TailwindCSS, sin embargo, también cuento con algunos conocimientos técnicos básicos de ",
  "about.mainmsg9": ", por ejemplo NodeJS, además cuento con cierto conocimiento de desarrollo móvil gracias a las tecnologías como React Native.",
  "about.mainmsg10": "Me considero una persona altamente responsable y que siempre trata de priorizar la calidad de su trabajo aun cuando no conozco al 100% la tecnología que se me pide, hago lo mejor posible para cumplir con mis propios estándares de calidad y los que se me propongan más adelante.",
  "about.mainmsg11": "Respecto a mis pasatiempos me gusta mucho jugar videojuegos, sobre todo que requieran una cantidad de estrategia considerable, también me gusta investigar sobre temas de la actualidad y con relevancia, tanto temas científicos y tecnológicos, me gusta mucho estar al día con este tipo de cosas ya que eso me da motivación para seguir adquiriendo conocimiento y no perderme de novedades interesantes, al mismo tiempo me gusta compartir cada conocimiento nuevo que adquiero e interiorizo con los demás.",
  "about.mainmsg12": "En cuanto a mi nivel de inglés, obtuve una calificación de B2 por parte de TOEFL ITP, esta calificación la conseguí en 2018 y desde entonces he seguido mejorando mis habilidades de inglés por mi cuenta para fortalecerme en el idioma. ",

  "about.DataListTitle1": "Mis datos",
  "about.DataList1st1": "Edad: ",
  "about.DataList1st2": " Años",
  "about.DataList2nd": "Estudios: Ingeniería",
  "about.DataList3rd": "Freelance: Disponible",
  "about.DataList4th1": "Blog personal: ",
  "about.DataList4th2": "Ir al blog (Inactivo)",
  "about.DataList5th": "Ciudad: Juarez, Chihhuahua. MX",
  "about.DataList6th": "Telefono: 656-393-1234",
  "about.DataList7th": "Correo: Chaotears@gmail.com",
  "about.DataListTitle2": "Idiomas",
  "about.DataList8th": "Español (Nativo)",
  "about.DataList9th": "Inglés  (Intermedio B2) ",
  "about.DataListTitle3": "Tecnologías que utilizo: ",
  "about.DataListTitle4": "Tecnologías que estoy aprendiendo: ",

  "about.download": "Descargar aquí",

  "about.title2": "Resumen",
  "about.title2.1": "Educación ",
  "about.title2.2": "Experiencia laboral ",

  "about.TitleEducation1": "Ingeniería en Sistemas Computacionales ",
  "about.DateEducation1": "2015-2020 ",
  "about.PlaceEducation1": "Instituto Tec. Ciudad Juárez ",
  "about.DescriptionEducation1": "Estudié durante 5 años mi carrera, donde por complicaciones pandémicas me resulto complicado terminar el proceso hasta casi 1 año después (2021), estudiando la carrera aprendí la increíble importancia que tienen los fundamentos de cualquier proceso de software, el aprender a ser autodidacta y a comunicarme y transmitir mis ideas hacia mis compañeros para poder trabajar en equipo para que el proyecto siga su marcha. ",
  "about.AboutEducation1": " ",

  "about.TitleEducation2": "Cursos en línea ",
  "about.DateEducation2": "2019 - Actualidad ",
  "about.PlaceEducation2": "Udemy - Platzi - Otros ",
  "about.DescriptionEducation2": "Antes terminar mi carrera me di cuenta de que la carrera por sí sola no bastaba para lo que yo me quería dedicar, por lo tanto decidí invertir más en mi educación, fue ahí cuando empecé a seguir cursos en línea de todo tipo que me ayudaran al crecimiento personal, gracias a los cursos de las plataformas conseguí los conocimientos de otras personas y los adapté a mí mismo, los utilizo a mi manera y me aseguro de seguir evolucionando el conocimiento que otras personas me transmitieron. ",
  "about.AboutEducation2": " ",

  "about.TitleExperience1": "Programador de app móvil",
  "about.DateExperience1": "2019-2020 (6 meses)",
  "about.PlaceExperience1": "MABU - Ciudad Juaréz, Chih. MX ",
  "about.DescriptionExperience1": "Fui el programador principal de la aplicación Casas de cambio Jrz., realicé la programación full stack de la misma en el framework de React Native y Firebase, desarrollé las herramientas de comunicación directa con las casas de cambio para poder añadirlas a la aplicación y estuve monitorizando el desempeño de la aplicación durante las primeras semanas del despliegue de la misma. ",
  "about.AboutExperience1": " ",

  "about.TitleExperience2": "Ingeniero de software | Frontend",
  "about.DateExperience2": "2021 - 2022 (1 año)",
  "about.PlaceExperience2": "Houm - Remoto",
  "about.DescriptionExperience2": " Me desempeñe como ingeniero de software frontend, utilizando React con TypeScript de la mano con Material UI, desarrollé múltiples vistas para el sistema interno de la empresa, ya sea visualización de tablas, agendas, formularios y mapas ademas escribí código de calidad y desarrollé componentes reutilizables, pruebas automáticas con Cypress, para garantizar la funcionalidad del desarrollo.",
  "about.AboutExperience2": " "
}
