{
    "app.test": "Bienvenida Saya",


    "nav.language":"Cambiar a Español",
    "nav.home":"Home",
    "nav.about":"About",
    "nav.projects":"Projects",
    "nav.contact":"Contact",

    "home.subtitle":"Web Developer",

    "contact.title":"Contact",
    "contact.title2":"Send me a message",
    "contact.name":"Your name:",
    "contact.phone":"Your phone:",
    "contact.email":"Your email:",
    "contact.subject":"Your subject:",
    "contact.message":"Your message:",
    "contact.button":"Send",
    "contact.confirm":"Message sent correctly, I will contact you as soon as possible.",
    "contact.fail":"Sorry, something went wrong, please try again later or email me directly, thank you.",

    "about.title":"About me",
    "about.mainmsg1":"Hello, My name is ",
    "about.mainmsg2":" and I am a web developer focused on Front-end. ",
    "about.mainmsg3":"I am an Engineer graduated from ",
    "about.mainmsg4":"Technological Institute of Ciudad Juaréz (TecNM)",
    "about.mainmsg5":", I successfully completed the career of ",
    "about.mainmsg6":"Computer Systems Engineering, taking the specialty of Advanced Software Development",
    "about.mainmsg7":", I am very excited to be able to work with recent technologies that allow to improve processes and help the development of complete and robust software, I specialize in",
    "about.mainmsg8":" web development with ReactJS and TailwindCSS, however I also have technical knowledge of ",
    "about.mainmsg9":", for example NodeJS or PHP, I also have some knowledge of mobile development thanks to technologies such as React Native or Ionic.",
    "about.mainmsg10":"I consider myself a highly responsible person who always tries to prioritize the quality of his work even when I do not know 100% the technology that is asked of me, I do my best to reach my own quality standards and those that are proposed to me later.",
    "about.mainmsg11":"Regarding my hobbies, I really like to play video games, especially those that require a considerable amount of strategy, I also like to investigate current and relevant issues, both scientific and technological issues, I really like to keep up to date with this type of thing since that gives me motivation to continue acquiring knowledge and not miss out on interesting news, at the same time I like to share each new knowledge that I acquire and internalize with others.",
    "about.mainmsg12":"Regarding my level of English, I obtained a score between B1 and B2 by TOEFL ITP, this score was achieved in 2018 and since then I have continued to improve my English skills on my own to strengthen myself in the language. ",

    
    "about.DataListTitle1":"My data",
    "about.DataList1st1":"Age: ",
    "about.DataList1st2":" Years",
    "about.DataList2nd":"Studies: Engineering",
    "about.DataList3rd":"Freelance: Available",
    "about.DataList4th1":"Blog: ",
    "about.DataList4th2":"Soon",
    "about.DataList5th":"City: Juarez, Chihuahua. MX",
    "about.DataList6th":"Phone: 656-393-1234",
    "about.DataList7th":"E-mail: Chaotears@gmail.com",
    "about.DataListTitle2":"Languages",
    "about.DataList8th":"Spanish (Native)",
    "about.DataList9th":"English (Intermediate) ",
    "about.DataListTitle3":"Technologies I use: ",
    "about.DataListTitle4":"Technologies I'm learning: ",

    "about.download":"Download here",

    "about.title2":"Summary",
    "about.title2.1":"Education ",
    "about.title2.2":"Work experience ",

    "about.TitleEducation1":"Computerstystems engineer ",
    "about.DateEducation1":"2015-2020 ",
    "about.PlaceEducation1":"Technological Institute of Ciudad Juaréz ",
    "about.DescriptionEducation1":"I studied my career for 5 years, where due to pandemic complications it was difficult for me to finish the process until almost 1 year later, studying the degree I learned the incredible importance of the fundamentals of any software process, learning to be self-taught and to communicate and transmit my ideas towards my colleagues to be able to work as a team so that the project continues its progress. ",
    "about.AboutEducation1":" ",

    "about.TitleEducation2":"Online courses ",
    "about.DateEducation2":"2019 - Present ",
    "about.PlaceEducation2":"Udemy - Platzi - EdTeam ",
    "about.DescriptionEducation2":"Before finishing my degree I realized that the career alone was not enough for what I wanted to dedicate myself, therefore I decided to invest more in my education, it was there when I began to follow online courses of all kinds that would help me personal growth, thanks to the courses of the platforms I got the knowledge of other people and adapted it to myself, I use it in my own way and I make sure to continue evolving the knowledge that other people transmitted to me.",
    "about.AboutEducation2":" ",
    
    "about.TitleExperience1":"Mobile app developer",
    "about.DateExperience1":"2019-2020 ",
    "about.PlaceExperience1":"MABU - Ciudad Juaréz, Chih. MX ",
    "about.DescriptionExperience1":"I was the main programmer of the Casas de Cambio Jrz application, I did the full stack programming of it in the Ionic framework in version 5 with Angular and Firebase, I developed the tools for direct communication with the exchange houses to be able to add them to the application and I was monitoring the performance of the application during the first weeks of its deployment.",
    "about.AboutExperience1":" ",

    "about.TitleExperience2":" ",
    "about.DateExperience2":" ",
    "about.PlaceExperience2":" ",
    "about.DescriptionExperience2":" ",
    "about.AboutExperience2":" ",

    "portfolio.title":"Projects",
    "portfolio.front":"Front-End Projects",
    "portfolio.back":"Back-End Projects",
    "portfolio.watch":"Watch details",
    "portfolio.link":"Go to site",

    "portfolio.card.typeLabel":"Type of application: ",
    "portfolio.card.dateLabel":"Year of development: ",
    "portfolio.card.featuresLabel":"Features: ",
    "portfolio.card.descriptionLabel":"Summary: ",
    "portfolio.card.tecLabel":"Languages and technologies used: ",

    "portfolio.ProjectTitle.portfolio":"Personal portfolio",
    "portfolio.ProjectDate.portfolio":"2021",
    "portfolio.ProjectFeatures.portfolio":"Dark/Bright Mode, Multi-Language, PWA",
    "portfolio.ProjectTec.portfolio":"Javascript, NextJS, TailwindCSS",
    "portfolio.ProjectType.portfolio":"Web",
    "portfolio.ProjectDescription.portfolio":"Te encuentras ahora mismo en mi portafolio personal, justamente en la sección de detalles del mismo, hasta la fecha este ha sido el proyecto personal del que más orgulloso estoy por la cantidad de tiempo que le dedique a la investigación de cada aspecto del mismo, cuenta con tecnologías modernas indispensables en cualquier sitio web moderno, como el selector de tema Oscuro y Brillante, además de la increíble rapidez y comodidad que otorga el framework de NextJS a la hora de desarrollar y desplegar la aplicación, además cuenta con un increíble diseño responsivo orientado a pantallas móviles primero, lo cual permite que la experiencia sea optima en cualquier situación posible, también cuenta con la característica de ser una Aplicación Web Progresiva (PWA), lo cual permite al usuario instalar la página web en su dispositivo que utilice en ese momento al acceder a la página web. ",

    "portfolio.ProjectTitle.personalBlog":"Personal blog",
    "portfolio.ProjectType.personalBlog":"Web",
    "portfolio.ProjectDate.personalBlog":"2021",
    "portfolio.ProjectFeatures.personalBlog":"Authentication, Image upload",
    "portfolio.ProjectTec.personalBlog":"Javascript, React",
    "portfolio.ProjectDescription.personalBlog":"Este blog fue diseñado con React y Strapi, la intención del blog es compartir conocimientos y opiniones que tenga referente a ciertos temas de interés, tanto de programación, como entretenimiento, la facilidad que me otorga Strapi como CMS de Back-end, me permite orientarme más al desarrollo Front-end del mismo, contando con características como buscador de publicaciones, selector de categorías, entre otras muchas características que debería tener cualquier blog mínimamente decente, elegí usar Strapi debido a que quería usar un CMS para facilitarme la vida, ya que quería utilizar algo que no fuera Firebase debido a que quise pulir mis habilidades respecto al consumo de apis restful, y Wordpress sencillamente me pareció algo que no debí tomar en cuenta para un proyecto donde el Back-end y Front-end se trabajan por separado, a pesar de dar la opción de hacerlo, Strapi simplemente es mejor pues ya está diseñado para esto. ",

    "portfolio.ProjectTitle.ASMPC":"Assembly pc",
    "portfolio.ProjectType.ASMPC":"Desktop",
    "portfolio.ProjectDate.ASMPC":"2019",
    "portfolio.ProjectFeatures.ASMPC":"SQL in depth",
    "portfolio.ProjectTec.ASMPC":"Java, SQL",
    "portfolio.ProjectDescription.ASMPC":"Este programa lo diseñe debido a que una de mis grandes pasiones es el hardware de computadora, no me gustaba nada la idea de que mis amigos malgastaran su dinero comprando componentes que no eran del todo compatibles con otros componentes y en muchos casos ni siquiera eran útiles, por lo tanto, siempre tenía que invertir una buena cantidad de mi tiempo para poder indicarles las mejores opciones costo/beneficio para sus necesidades, ya fueran profesionales o de ocio, el programa cuenta con selectores a prueba de fallos para asegurarse de que el usuario no pueda seleccionar ninguna pieza de hardware incompatible, siguiendo meticulosamente las especificaciones en orden de cada componente, ya sea sockets, consumo, o tamaño, además del precio. ",

    "portfolio.ProjectTitle.CDC":"Exchange houses APP",
    "portfolio.ProjectType.CDC":"Mobile",
    "portfolio.ProjectDate.CDC":"2019-2020",
    "portfolio.ProjectFeatures.CDC":"Real-time updates",
    "portfolio.ProjectTec.CDC":"Javascript, Firebase",
    "portfolio.ProjectDescription.CDC":"Esta aplicación fue pensada para mejorar la calidad de vida de los residentes de la frontera México - Estados Unidos que viajan constantemente al país vecino para hacer sus compras, debido a que el cambio de divisas es un negocio enorme y que varía muy frecuentemente, a veces resulta muy difícil encontrar el lugar ideal para hacer el cambio, donde el usuario pierda menos dinero, por lo tanto, la idea principal de la aplicación es tener al alcance de un simple clic las actualizaciones en tiempo real de cada casa de cambio disponible y cercana al usuario, para que de esta manera pueda decidir dónde ir a cambiar su divisa, todo esto es posible gracias a que Firebase proporciona un servicio increíblemente veloz y a tiempo real, además de la tecnología hibrida que permitía hacer aplicaciones móviles tanto para Android como para IOS llamada Ionic, si bien hoy en día sin duda alguna elegiría una opción mucho menos problemática como React Native o Flutter, aprendí mucho gracias al desarrollo con esta y no me arrepiento en lo absoluto del resultado. ",

    "portfolio.ProjectTitle.ProductHunt":"Product Hunt Clone",
    "portfolio.ProjectType.ProductHunt":"Web",
    "portfolio.ProjectDate.ProductHunt":"2021",
    "portfolio.ProjectFeatures.ProductHunt":"Search engine, NOSQL",
    "portfolio.ProjectTec.ProductHunt":"Javascript, NextJS, Firebase",
    "portfolio.ProjectDescription.ProductHunt":"Este clon de la página Product hunt forma parte de un curso de Udemy donde mejore muchísimo mis conocimientos sobre react, sin embargo el curso es algo viejo y desactualizado en esa parte, por lo cual ni siguiendo todos los pasos del instructor se consigue hacer que la aplicación funcione correctamente, se encuentra en esta sección como parte de mi experiencia ya que gran parte de la lógica la tuve que cambiar de la aplicación para hacer que funcione correctamente, aunque  no representa una gran demostración de mis conocimientos, sí que representa mi capacidad de buscar y arreglar errores por mi cuenta.",

    "portfolio.ProjectTitle.weather":"Weather",
    "portfolio.ProjectType.weather":"Web",
    "portfolio.ProjectDate.weather":"2021",
    "portfolio.ProjectFeatures.weather":"Api consumption, PWA",
    "portfolio.ProjectTec.weather":"Javascript, React",
    "portfolio.ProjectDescription.weather":"Este proyecto lo realice únicamente como practica debido a que quería mejorar mis habilidades sobre el consumo de apis restful pero al mismo tiempo me di cuenta que quería una aplicación de clima que fuera de acuerdo a mis necesidades cuando mirara el celular, los datos relevantes que a mí me gusta mirar y no tener que perder tiempo viendo datos irrelevantes, por lo tanto decidí hacerla PWA para poder instalarla y no tener que abrir el navegador cada que quisiera acceder a ella con un simple click y no tener que buscar mi ciudad constantemente.  ",

    "portfolio.ProjectTitle.chat":"Chat in real time",
    "portfolio.ProjectType.chat":"Web",
    "portfolio.ProjectDate.chat":"2021",
    "portfolio.ProjectFeatures.chat":"Live chat",
    "portfolio.ProjectTec.chat":"Javascript, React, Firebase",
    "portfolio.ProjectDescription.chat":"La intención de este chat es tratar de replicar el chat de la plataforma conocida como Twitch, o del chat en vivo de los directos de Youtube, donde cualquier persona con una cuenta pueda comentar lo que está ocurriendo en ese preciso momento, si bien no es una aplicación pensada para escalar mucho, la funcionalidad es lo que más me interesa ya que al no ser un proyecto grande, me interesa más la experiencia de hacer algo así, el uso de React ayudo muchísimo a las actualizaciones constantes gracias a su sistema de componentes y Firebase que ayuda al sistema de hacer un sistema en tiempo real y fácil de utilizar para cualquiera. ",
    
    "portfolio.ProjectTitle.blogphp":"PHP blog",
    "portfolio.ProjectType.blogphp":"Web",
    "portfolio.ProjectDate.blogphp":"2019",
    "portfolio.ProjectFeatures.blogphp":"MVC, Search engine",
    "portfolio.ProjectTec.blogphp":"PHP",
    "portfolio.ProjectDescription.blogphp":"Este blog fue hecho únicamente como motivo de práctica mientras aprendía los conceptos de PHP, forma parte de un curso de PHP que tome de la plataforma Udemy, el motivo por el que se encuentra aquí es que le añadí algunas modificaciones a las consultas de base de datos y mejoras a la aplicación que eran completamente ajenas al curso, como local storage y reestructuración de archivos para pasarlo a MVC, lo cual me ayudo bastante a comprender el funcionamiento de PHP de forma interna, es un proyecto muy simple sin embargo me siento muy contento con las modificaciones ajenas al curso pues pude demostrarme a mí mismo que en efecto estaba aprendiendo el lenguaje y a su vez me ayudo a entender el entorno de wordpress.",
    
    "portfolio.ProjectTitle.ffxiv":"FFXIV QoL",
    "portfolio.ProjectType.ffxiv":"Web",
    "portfolio.ProjectDate.ffxiv":"2021",
    "portfolio.ProjectFeatures.ffxiv":"Search engine, Api consumption",
    "portfolio.ProjectTec.ffxiv":"Javascript, React",
    "portfolio.ProjectDescription.ffxiv":"Esta aplicación no es más que un capricho personal para maximizar mi eficiencia en el videojuego de Final Fantasy XIV, consiste en consumir la api del juego para poder tener a medida absolutamente cualquier objeto del juego que necesite crear dentro del mismo, ya sean materiales, locaciones e incluso precios de los materiales, el juego no cuenta con una aplicación oficial similar, así que decidí hacer la mía, ya que le dedico bastante tiempo a este videojuego que es mi favorito, pensé que podría utilizarlo para mejorar mis habilidades de programación a la vez que mejoraba mi eficiencia en el juego. ",
    
    "portfolio.ProjectTitle.taquero":"Taquero",
    "portfolio.ProjectType.taquero":"Desktop",
    "portfolio.ProjectDate.taquero":"2017",
    "portfolio.ProjectFeatures.taquero":"OpenGL",
    "portfolio.ProjectTec.taquero":"C++",
    "portfolio.ProjectDescription.taquero":"Este fue el primer proyecto medianamente grande que desarrolle con la ayuda de amigos en la escuela, se diseñó un motor gráfico muy sencillo 2D con la ayuda de OpenGL para poder desarrollar el escenario y los personajes, es un proyecto extremadamente simple, sin embargo, los conceptos de la programación orientada a objetos llevados a mi pasatiempo favorito me fueron demasiado útiles a la hora de seguir progresando en mi carrera de programador.",
    
    "portfolio.ProjectTitle.apiLaravel":"Api Laravel",
    "portfolio.ProjectType.apiLaravel":"Web",
    "portfolio.ProjectDate.apiLaravel":"2021",
    "portfolio.ProjectFeatures.apiLaravel":"JWT, Authentication, MySQL",
    "portfolio.ProjectTec.apiLaravel":"PHP",
    "portfolio.ProjectDescription.apiLaravel":"Esta api rest desarrollada en laravel es un Back-end orientado a un blog simple, pensé en utilizarlo para el portafolio personal, sin embargo al final lo descarte debido a que si bien me permite alojar la api en un servicio de hosting compartido muy barato, no quería que la lentitud del sistema le hiciera un cuello de botella a React, debido a que el Back-end no es mi especialidad y no le dedique tanto tiempo como quisiera, se quedó de una forma que no cumplía con mis propios estándares de calidad y lo acabe dejando, sin embargo es completamente funcional para su objetivo principal y aprendí muchísimo del mundo Back-end pues fue mi primera api rest. ",
    
    "portfolio.ProjectTitle.apiNode":"Api NodeJS",
    "portfolio.ProjectType.apiNode":"Web",
    "portfolio.ProjectDate.apiNode":"2021",
    "portfolio.ProjectFeatures.apiNode":"JWT, Authentication, MongoDB",
    "portfolio.ProjectTec.apiNode":"Javascript, NodeJS, Express",
    "portfolio.ProjectDescription.apiNode":"Esta api rest está desarrollada usando NodeJS y Express, utilizando como base de datos no relacionales a MongoDB, fue mi primer acercamiento al MERN stack, quería aprender mucho más de JWT y ya que el objetivo era únicamente de aprender, le di un enfoque a blog simple donde pudiera aprender las bases de Express, NodeJS y MongoDB, al mismo tiempo que me metía en temas como autenticación y mejoraba mis habilidades de javascript. ",
    
    "portfolio.ProjectTitle.strapiBlog":"Backend Blog Strapi",
    "portfolio.ProjectType.strapiBlog":"Web",
    "portfolio.ProjectDate.strapiBlog":"2021",
    "portfolio.ProjectFeatures.strapiBlog":"Authentication, Headless CMS",
    "portfolio.ProjectTec.strapiBlog":"Javascript, Strapi",
    "portfolio.ProjectDescription.strapiBlog":"Por motivos de practica con el Front-end, utilizar una api rest a medida significaba una pérdida de tiempo considerable, por lo que decidí utilizar un CMS para el Back-end, en este caso elegí Strapi ya que no tiene lado de Front-end, por lo tanto es mucho más sencillo para mi manipular los endpoints y poder conectar ambas partes para desarrollar la aplicación full stack, este Back-end es el Back-end del proyecto de blog personal que se encuentra en la sección de Front-end. ",
    
    "portfolio.ProjectTitle.test":"",
    "portfolio.ProjectType.test":"",
    "portfolio.ProjectDate.test":"",
    "portfolio.ProjectFeatures.test":"",
    "portfolio.ProjectTec.test":"",
    "portfolio.ProjectDescription.test":"",
    

    "test":"",
    "test2":""
}