{
  "app.test": "Bienvenida Saya",

  "nav.language": "Cambiar a Español",
  "nav.home": "Home",
  "nav.about": "About",
  "nav.projects": "Projects",
  "nav.contact": "Contact",

  "error.title": "Error 404",
  "error.subtitle": "The page you are looking for doesn't exist, please use the navigation bar to continue your navigation.",

  "home.subtitle": "Web Developer",

  "contact.title": "Contact",
  "contact.title2": "Send me a message",
  "contact.name": "Your name:",
  "contact.phone": "Your phone:",
  "contact.email": "Your email:",
  "contact.subject": "Your subject:",
  "contact.message": "Your message:",
  "contact.button": "Send",
  "contact.confirm": "Message sent correctly, I will contact you as soon as possible.",
  "contact.fail": "Sorry, something went wrong, please try again later or email me directly, thank you.",

  "about.title": "About me",
  "about.mainmsg1": "Hello, My name is ",
  "about.mainmsg2": " and I am a web developer focused on Front-end. ",
  "about.mainmsg3": "I am an Engineer graduated from ",
  "about.mainmsg4": "Technological Institute of Ciudad Juaréz (TecNM)",
  "about.mainmsg5": ", I successfully completed the career of ",
  "about.mainmsg6": "Computer Systems Engineering, taking the specialty of Advanced Software Development",
  "about.mainmsg7": ", I am very excited to be able to work with recent technologies that allow to improve processes and help the development of complete and robust software, I specialize in ",
  "about.mainmsg8": " web development with ReactJS and TailwindCSS, however I also have some basic technical knowledge of ",
  "about.mainmsg9": ", for example NodeJS, I also have some knowledge of mobile development thanks to technologies such as React Native.",
  "about.mainmsg10": "I consider myself a highly responsible person who always tries to prioritize the quality of his work even when I do not know 100% the technology that is asked of me, I do my best to reach my own quality standards and those that are proposed to me later.",
  "about.mainmsg11": "Regarding my hobbies, I really like to play video games, especially those that require a considerable amount of strategy, I also like to investigate current and relevant issues, both scientific and technological issues, I really like to keep up to date with this type of thing since that gives me motivation to continue acquiring knowledge and not miss out on interesting news, at the same time I like to share each new knowledge that I acquire and internalize with others.",
  "about.mainmsg12": "Regarding my level of English, I obtained a score of B2 by TOEFL ITP, this score was achieved in 2018 and since then I have continued to improve my English skills on my own to strengthen myself in the language. ",

  "about.DataListTitle1": "My data",
  "about.DataList1st1": "Age: ",
  "about.DataList1st2": " Years",
  "about.DataList2nd": "Studies: Engineering",
  "about.DataList3rd": "Freelance: Available",
  "about.DataList4th1": "Personal blog: ",
  "about.DataList4th2": "Go to blog (Available only in spanish)",
  "about.DataList5th": "City: Juarez, Chihuahua. MX",
  "about.DataList6th": "Phone: 656-393-1234",
  "about.DataList7th": "E-mail: Chaotears@gmail.com",
  "about.DataListTitle2": "Languages",
  "about.DataList8th": "Spanish (Native)",
  "about.DataList9th": "English (Intermediate B2) ",
  "about.DataListTitle3": "Technologies I use: ",
  "about.DataListTitle4": "Technologies I'm learning: ",

  "about.download": "Download here",

  "about.title2": "Summary",
  "about.title2.1": "Education ",
  "about.title2.2": "Work experience ",

  "about.TitleEducation1": "Computer Systems Engineer ",
  "about.DateEducation1": "2015-2020 ",
  "about.PlaceEducation1": "Technological Institute of Ciudad Juárez ",
  "about.DescriptionEducation1": "I studied my career for 5 years, where due to pandemic complications it was difficult for me to finish the process until almost 1 year later (2021), while studying the degree I learned the incredible importance of the fundamentals of any software process, learning to be self-taught and to communicate and transmit my ideas towards my colleagues to be able to work as a team so that the project continues its progress. ",
  "about.AboutEducation1": " ",

  "about.TitleEducation2": "Online courses ",
  "about.DateEducation2": "2019 - Present ",
  "about.PlaceEducation2": "Udemy - Platzi - Others ",
  "about.DescriptionEducation2": "Before finishing my degree I realized that the career alone was not enough for what I wanted to dedicate myself, therefore I decided to invest more in my education, it was there when I began to follow online courses of all kinds that would help my personal growth, thanks to the courses of the platforms I got the knowledge of other people and adapted it to myself, I use it in my own way and I make sure to continue evolving the knowledge that other people transmitted to me.",
  "about.AboutEducation2": " ",

  "about.TitleExperience1": "Mobile app developer",
  "about.DateExperience1": "2019-2020 (6 months)",
  "about.PlaceExperience1": "MABU - Ciudad Juaréz, Chih. MX ",
  "about.DescriptionExperience1": "I was the main programmer of the Casas de Cambio Jrz application, I did the full stack programming of it in the React Native framework and Firebase, I developed the tools for direct communication with the exchange houses to be able to add them to the application and I was monitoring the performance of the application during the firsts weeks of its deployment.",
  "about.AboutExperience1": " ",

  "about.TitleExperience2": "Software Engineer | Frontend",
  "about.DateExperience2": "2021 - 2022 (1 year)",
  "about.PlaceExperience2": "Houm - Remote",
  "about.DescriptionExperience2": "I worked as a frontend software engineer, using React with TypeScript along with Material UI, developed multiple views for the company's internal system, such as visualization of tables, agendas, forms and maps, also wrote quality code and developed reusable components, automated tests with Cypress, to ensure the functionality of the development.",
  "about.AboutExperience2": " ",

  "about.TitleExperience3": " ",
  "about.DateExperience3": " ",
  "about.PlaceExperience3": " ",
  "about.DescriptionExperience3": " ",
  "about.AboutExperience3": " ",

  "portfolio.title": "Projects",
  "portfolio.front": "Front-End Projects",
  "portfolio.back": "Back-End Projects",
  "portfolio.course": "Courses Projects",
  "portfolio.watch": "Watch details",
  "portfolio.link": "Go to site",

  "portfolio.card.typeLabel": "Type of application: ",
  "portfolio.card.dateLabel": "Year of development: ",
  "portfolio.card.featuresLabel": "Features: ",
  "portfolio.card.descriptionLabel": "Summary: ",
  "portfolio.card.tecLabel": "Languages and technologies used: ",

  "portfolio.ProjectTitle.portfolio": "Personal portfolio",
  "portfolio.ProjectDate.portfolio": "2021",
  "portfolio.ProjectFeatures.portfolio": "Dark/Bright Mode, Multi-Language, PWA, SSR",
  "portfolio.ProjectTec.portfolio": "Javascript, NextJS, TailwindCSS",
  "portfolio.ProjectType.portfolio": "Web",
  "portfolio.ProjectDescription.portfolio": "You are right now in my personal portfolio, just in the details section of it, this was my first personal project done in React using server side rendering with NextJS, it has modern technologies essential in any modern website, such as the Dark and Bright theme selector, it also has an incredible responsive design oriented to mobile screens first, which allows the experience to be optimal in any possible situation, it also has the feature of being a Progressive Web Application (PWA), which allows the user to install the website on their device that they use at that moment when accessing the website.  ",

  "portfolio.ProjectTitle.personalBlog": "Personal blog",
  "portfolio.ProjectType.personalBlog": "Web",
  "portfolio.ProjectDate.personalBlog": "2021",
  "portfolio.ProjectFeatures.personalBlog": "Zustand, Search bar, SPA, Markdown",
  "portfolio.ProjectTec.personalBlog": "Javascript, React, TailwindCSS",
  "portfolio.ProjectDescription.personalBlog": "This blog was designed with React and Strapi, the intention of the blog is to share knowledge and opinions that I have regarding certain topics of interest, both programming and entertainment, the ease that gives me Strapi as a CMS Back-end, allows me to focus more on the Front-end development of the same project, with features such as search engine publications, category selector, among many other features that should have any minimally decent blog, I chose to use Strapi because I wanted to use a CMS to make my life easier, since I wanted to use something other than Firebase because I wanted to polish my skills regarding the consumption of restful apis, and Wordpress simply seemed to me something that I should not take into account for a project where the Back-end and Front-end are worked separately, despite giving the option to do so, Strapi is simply better because it is already designed for this. ",

  "portfolio.ProjectTitle.ASMPC": "Assembly pc",
  "portfolio.ProjectType.ASMPC": "Desktop",
  "portfolio.ProjectDate.ASMPC": "2019",
  "portfolio.ProjectFeatures.ASMPC": "SQL in depth",
  "portfolio.ProjectTec.ASMPC": "Java, SQL",
  "portfolio.ProjectDescription.ASMPC": "I designed this program because one of my great passions is computer hardware, I did not like the idea of my friends wasting their money buying components that were not fully compatible with other components and in many cases were not even useful, therefore, I always had to invest a good amount of my time to be able to indicate the best cost/benefit options for their needs, whether they were professional or leisure, the program has fail-safe selectors to ensure that the user cannot select any incompatible piece of hardware, meticulously following the specifications in order of each component, be it sockets, power consumption, or size, as well as price. ",

  "portfolio.ProjectTitle.CDC": "Exchange houses APP",
  "portfolio.ProjectType.CDC": "Mobile",
  "portfolio.ProjectDate.CDC": "2019-2020",
  "portfolio.ProjectFeatures.CDC": "Real-time updates",
  "portfolio.ProjectTec.CDC": "Javascript, Firebase",
  "portfolio.ProjectDescription.CDC": "This application was designed to improve the quality of life of residents of the Mexico - United States border who constantly travel to the nearby country to make their purchases, because the currency exchange is a huge business and varies very frequently, sometimes it is very difficult to find the ideal place to make the change, where the user loses less money, therefore, the main idea of the application is to have within reach of a simple click the real-time updates of each exchange house available and close to the user, so that in this way you can decide where to go to change your currency, all this is possible thanks to Firebase provides an incredibly fast service and in real time, in addition to the hybrid technology that allowed to make mobile applications for both Android and IOS called React Native, I learned a lot thanks to the development with this and I do not regret the result at all. ",

  "portfolio.ProjectTitle.ProductHunt": "Product Hunt Clone",
  "portfolio.ProjectType.ProductHunt": "Web",
  "portfolio.ProjectDate.ProductHunt": "2021",
  "portfolio.ProjectFeatures.ProductHunt": "Search engine, NOSQL",
  "portfolio.ProjectTec.ProductHunt": "Javascript, NextJS, Firebase",
  "portfolio.ProjectDescription.ProductHunt": "This clone of the Product hunt page is part of a Udemy course where I improved a lot my knowledge about react, however the course is somewhat old and outdated in that part, so not even following all the steps of the instructor is able to make the application work correctly, it is in this section as part of my experience since I had to change much of the logic of the application to make it work correctly, although it does not represent a great demonstration of my knowledge, it does represent my ability to find and fix bugs on my own.",

  "portfolio.ProjectTitle.weather": "Weather",
  "portfolio.ProjectType.weather": "Web",
  "portfolio.ProjectDate.weather": "2021",
  "portfolio.ProjectFeatures.weather": "Api weather, Dinamic visual info",
  "portfolio.ProjectTec.weather": "Javascript, React",
  "portfolio.ProjectDescription.weather": "This project is very basic and was done only as a practice because I wanted to improve my skills on apis restful consumption but at the same time I realized that I wanted a weather application that was according to my needs, the relevant data that I like to look at and not have to waste time looking at irrelevant data.  ",

  "portfolio.ProjectTitle.chat": "Chat in real time",
  "portfolio.ProjectType.chat": "Web",
  "portfolio.ProjectDate.chat": "2021",
  "portfolio.ProjectFeatures.chat": "Live chat",
  "portfolio.ProjectTec.chat": "Javascript, React, Firebase",
  "portfolio.ProjectDescription.chat": "The intention of this chat is to try to replicate the chat of the platform known as Twitch, or the live chat of Youtube live, where anyone with an account can comment on what is happening at that precise moment, although it is not an application designed to scale much, the functionality is what interests me most because not being a large project, I'm more interested in the experience of doing something like this, the use of React helped a lot to constant updates thanks to its system of components and Firebase that helps the system to make a real-time system and easy to use for anyone. ",

  "portfolio.ProjectTitle.blogphp": "PHP blog",
  "portfolio.ProjectType.blogphp": "Web",
  "portfolio.ProjectDate.blogphp": "2019",
  "portfolio.ProjectFeatures.blogphp": "MVC, Search engine",
  "portfolio.ProjectTec.blogphp": "PHP",
  "portfolio.ProjectDescription.blogphp": "This blog was made only as a practice while learning PHP concepts, it is part of a PHP course that I took from Udemy platform, the reason why it is here is that I added some modifications to the database queries and improvements to the application that were completely outside the course, such as local storage and file restructuring to make it MVC, which helped me a lot to understand how PHP works internally, it is a very simple project but I feel very happy with the modifications outside the course because I could prove to myself that I was indeed learning the language and in turn helped me to understand the wordpress environment. ",

  "portfolio.ProjectTitle.ffxiv": "FFXIV QoL",
  "portfolio.ProjectType.ffxiv": "Web",
  "portfolio.ProjectDate.ffxiv": "2021",
  "portfolio.ProjectFeatures.ffxiv": "Search engine, Api consumption",
  "portfolio.ProjectTec.ffxiv": "Javascript, React",
  "portfolio.ProjectDescription.ffxiv": "This application is nothing more than a personal whim to maximize my efficiency in the Final Fantasy XIV video game, it consists of consuming the api of the game to be able to have absolutely any object of the game that I need to create within the game, whether materials, locations and even prices of materials, the game does not have a similar official application, so I decided to make my own, since I dedicate enough time to this video game that is my favorite, I thought I could use it to improve my programming skills while improving my efficiency in the game. ",

  "portfolio.ProjectTitle.taquero": "Taquero",
  "portfolio.ProjectType.taquero": "Desktop",
  "portfolio.ProjectDate.taquero": "2017",
  "portfolio.ProjectFeatures.taquero": "OpenGL",
  "portfolio.ProjectTec.taquero": "C++",
  "portfolio.ProjectDescription.taquero": "This was the first moderately large project I developed with the help of friends at school, a very simple 2D graphics engine was designed with the help of OpenGL to develop the scenery and characters, it is an extremely simple project, however, the concepts of object oriented programming taken to my favorite hobby were too useful when it came to further progress in my career as a programmer.",

  "portfolio.ProjectTitle.apiLaravel": "Api Laravel",
  "portfolio.ProjectType.apiLaravel": "Web",
  "portfolio.ProjectDate.apiLaravel": "2021",
  "portfolio.ProjectFeatures.apiLaravel": "JWT, Authentication, MySQL",
  "portfolio.ProjectTec.apiLaravel": "PHP",
  "portfolio.ProjectDescription.apiLaravel": "This api rest developed in laravel is a back-end oriented to a simple blog, I thought about using it for the personal portfolio, however in the end I discarded it because multiple reasons, since Back-end is not my specialty and I didn't spend as much time as I wanted, it stayed in a way that didn't meet my own quality standards and I ended up leaving it, however it is fully functional for its main purpose and I learned a lot about the Back-end world because it was my first api rest. ",

  "portfolio.ProjectTitle.apiNode": "Api NodeJS",
  "portfolio.ProjectType.apiNode": "Web",
  "portfolio.ProjectDate.apiNode": "2021",
  "portfolio.ProjectFeatures.apiNode": "JWT, Authentication, MongoDB",
  "portfolio.ProjectTec.apiNode": "Javascript, NodeJS, Express",
  "portfolio.ProjectDescription.apiNode": "This api rest is developed using NodeJS and Express, using MongoDB as a non-relational database, it was my first approach to the MERN stack, I wanted to learn a lot more about JWT and since the goal was only to learn, I gave a simple blog approach where I could learn the basics of Express, NodeJS and MongoDB, at the same time I was getting into topics like authentication and improving my javascript skills. ",

  "portfolio.ProjectTitle.strapiBlog": "Backend Blog Strapi",
  "portfolio.ProjectType.strapiBlog": "Web",
  "portfolio.ProjectDate.strapiBlog": "2021",
  "portfolio.ProjectFeatures.strapiBlog": "Authentication, Headless CMS",
  "portfolio.ProjectTec.strapiBlog": "Javascript, Strapi, Cloudinary, Heroku",
  "portfolio.ProjectDescription.strapiBlog": "For practice reasons with the Front-end, using a custom api rest meant something a bit far of my posibilities, so I decided to use a CMS for the Back-end, in this case I chose Strapi because it has no Front-end side, so it is much easier for me to manipulate the endpoints and to connect both parts to develop the full stack application, this Back-end is the Back-end of the personal blog project that is in the Front-end section. ",

  "portfolio.ProjectTitle.test": "",
  "portfolio.ProjectType.test": "",
  "portfolio.ProjectDate.test": "",
  "portfolio.ProjectFeatures.test": "",
  "portfolio.ProjectTec.test": "",
  "portfolio.ProjectDescription.test": "",

  "about.popover.HTML": "HTML is the most basic component of the Web. It defines the meaning and structure of web content.",
  "about.popover.CSS": "CSS is the styling language used to describe the presentation of HTML or XML documents and describes how the structured element should be rendered on screen, on paper, in speech or other media.",
  "about.popover.Javascript": "JavaScript is an interpreted programming language, a dialect of the ECMAScript standard. It is defined as object-oriented, prototype-based, imperative, weakly typed and dynamic.",
  "about.popover.Git": "Git is a version control software designed by Linus Torvalds with efficiency, reliability and compatibility of application version maintenance in mind when applications have a large number of source code files.",
  "about.popover.React": "React is an open source Javascript library designed to create user interfaces with the goal of facilitating the development of single-page applications. It is maintained by Facebook and the open source community.",
  "about.popover.Tailwind": "Tailwind is a utility CSS framework, it does not come with predefined components. Instead, Tailwind CSS operates at a lower level and provides you with a set of CSS helper classes. ",
  "about.popover.Bootstrap": "Bootstrap is a cross-platform library or open source toolkit for website and web application design. It contains design templates with typography, forms, buttons, boxes, navigation menus and other HTML and CSS-based design elements, as well as additional JavaScript extensions. ",
  "about.popover.Firebase": "It is a platform located in the cloud, integrated with Google Cloud Platform, which uses a set of tools for the creation and synchronization of projects that will be endowed with high quality, making possible the growth of the number of users.",
  "about.popover.Rest API": "REST is a style of software architecture for distributed systems such as the World Wide Web. The term originated in 2000, in a doctoral thesis on the web written by Roy Fielding, one of the main authors of the HTTP protocol specification, and has become widely used by the development community.",
  "about.popover.SQL": "SQL is a domain-specific programming language designed to manage and retrieve information from relational database management systems.",
  "about.popover.MongoDB": "MongoDB is an open source, document-oriented, NoSQL database system. Instead of storing data in tables, as is done in relational databases, MongoDB stores BSON data structures with a dynamic schema, making data integration in certain applications easier and faster.",
  "about.popover.NodeJS": "Node.js is a cross-platform, open source, server-side runtime environment based on the JavaScript programming language, asynchronous, with data I/O in an event-driven architecture and based on Google's V8 engine.",
  "about.popover.Express": "Express is a back-end web application framework for Node.js, released as free and open source software under the MIT license. It is designed for building web applications and APIs. It has been called the de facto standard server framework for Node.js.",
  "about.popover.GraphQL": "GraphQL is a query and data manipulation language for APIs, and a runtime environment for performing queries against existing data. GraphQL was developed internally by Facebook in 2012 before being released publicly in 2015.",
  "about.popover.VueJs": "Vue.js is an open source JavaScript framework for building user interfaces and single-page applications. It was created by Evan You, and is maintained by him and the rest of the active core team members who come from various companies such as Netlify and Netguru.​",
  "about.popover.PHP": "PHP is a programming language for developing web applications and creating web pages, supporting the connection between servers and the user interface.",
  "about.popover.Laravel": "Laravel is an open source framework for developing web applications and services with PHP 5, PHP 7 and PHP 8. Its philosophy is to develop PHP code in an elegant and simple way, avoiding spaghetti code. It was created in 2011 and is heavily influenced by frameworks such as Ruby on Rails, Sinatra and ASP.NET MVC.​",
  "about.popover.Python": "Python is an interpreted programming language whose philosophy emphasizes the readability of its code. It is a multi-paradigm programming language, as it partially supports object-oriented, imperative programming and, to a lesser extent, functional programming.",
  "about.popover.Angular": "Angular is a web application framework developed in TypeScript, open source, maintained by Google, which is used to create and maintain single-page web applications.",

  "test": "",
  "test2": ""
}
