{
    "app.test": "Bienvenida Saya",


    "nav.language":"Change to English",
    "nav.home":"Inicio",
    "nav.about":"Sobre mi",
    "nav.projects":"Proyectos",
    "nav.contact":"Contacto",

    "home.subtitle":"Desarrollador Web",
    
    "contact.title":"Contacto",
    "contact.title2":"Mandame un mensaje",
    "contact.name":"Tu nombre:",
    "contact.phone":"Tu telefono:",
    "contact.email":"Tu correo electronico:",
    "contact.subject":"Tu asunto:",
    "contact.message":"Tu mensaje:",
    "contact.button":"Enviar",
    "contact.confirm":"Mensaje enviado correctamente, me pondre en contacto contigo a la brevedad posible.",
    "contact.fail":"Lo siento, algo ha salido mal, intentalo de nuevo mas tarde o mandame un correo directamente, gracias.",

    "about.title":"Sobre mi",
    "about.mainmsg1":"Hola, mi nombre es ",
    "about.mainmsg2":" y soy desarrollador web enfocado al Front-end. ",
    "about.mainmsg3":"Soy Ingeniero egresado del ",
    "about.mainmsg4":"Instituto Tecnológico de Ciudad Juaréz (TecNM)",
    "about.mainmsg5":", concluí con éxito la carrera de ",
    "about.mainmsg6":"Ingeniería en Sistemas computacionales, tomando la especialidad de Desarrollo de software avanzado",
    "about.mainmsg7":", me entusiasma mucho poder trabajar con tecnologías recientes que permitan mejorar los procesos y ayuden al desarrollo de software completo y robusto, me especializo en el desarrollo web  ",
    "about.mainmsg8":" con ReactJS y TailwindCSS, sin embargo, también cuento con conocimientos técnicos de ",
    "about.mainmsg9":", por ejemplo NodeJS o PHP, además cuento con cierto conocimiento de desarrollo móvil gracias a las tecnologías como React Native o Ionic.",
    "about.mainmsg10":"Me considero una persona altamente responsable y que siempre trata de priorizar la calidad de su trabajo aun cuando no conozco al 100% la tecnología que se me pide, hago lo mejor posible para cumplir con mis propios estándares de calidad y los que se me propongan más adelante.",
    "about.mainmsg11":"Respecto a mis pasatiempos me gusta mucho jugar videojuegos, sobre todo que requieran una cantidad de estrategia considerable, también me gusta investigar sobre temas de la actualidad y con relevancia, tanto temas científicos y tecnológicos, me gusta mucho estar al día con este tipo de cosas ya que eso me da motivación para seguir adquiriendo conocimiento y no perderme de novedades interesantes, al mismo tiempo me gusta compartir cada conocimiento nuevo que adquiero e interiorizo con los demás.",
    "about.mainmsg12":"En cuanto a mi nivel de inglés, obtuve una calificación entre B1 y B2 por parte de TOEFL ITP, esta calificación la conseguí en 2018 y desde entonces he seguido mejorando mis habilidades de inglés por mi cuenta para fortalecerme en el idioma. ",

    "about.DataListTitle1":"Mis datos",
    "about.DataList1st1":"Edad: ",
    "about.DataList1st2":" Años",
    "about.DataList2nd":"Estudios: Ingenieria",
    "about.DataList3rd":"Freelance: Disponible",
    "about.DataList4th1":"Blog: ",
    "about.DataList4th2":"Proximamente",
    "about.DataList5th":"Ciudad: Juarez, Chihhuahua. MX",
    "about.DataList6th":"Telefono: 656-393-1234",
    "about.DataList7th":"Correo: Chaotears@gmail.com",
    "about.DataListTitle2":"Idiomas",
    "about.DataList8th":"Español (Nativo)",
    "about.DataList9th":"Ingles (Intermedio) ",
    "about.DataListTitle3":"Tecnologías que utilizo: ",
    "about.DataListTitle4":"Tecnologías que estoy aprendiendo: ",

    "about.download":"Descargar aqui",
    
    "about.title2":"Resumen",
    "about.title2.1":"Educacion ",
    "about.title2.2":"Experiencia laboral ",

    "about.TitleEducation1":"Ingenieria en Sistemas Computacionales ",
    "about.DateEducation1":"2015-2020 ",
    "about.PlaceEducation1":"Instituto Tec. Ciudad Juaréz ",
    "about.DescriptionEducation1":"Estudié durante 5 años mi carrera, donde por complicaciones pandémicas me resulto complicado terminar el proceso hasta casi 1 año después, estudiando la carrera aprendí la increíble importancia que tienen los fundamentos de cualquier proceso de software, el aprender a ser autodidacta y a comunicarme y transmitir mis ideas hacia mis compañeros para poder trabajar en equipo para que el proyecto siga su marcha. ",
    "about.AboutEducation1":" ",

    "about.TitleEducation2":"Cursos en linea ",
    "about.DateEducation2":"2019-Actualidad ",
    "about.PlaceEducation2":"Udemy - Platzi - EdTeam ",
    "about.DescriptionEducation2":"Antes terminar mi carrera me di cuenta de que la carrera por sí sola no bastaba para lo que yo me quería dedicar, por lo tanto decidí invertir más en mi educación, fue ahí cuando empecé a seguir cursos en línea de todo tipo que me ayudaran al crecimiento personal, gracias a los cursos de las plataformas conseguí los conocimientos de otras personas y los adapte a mí mismo, los utilizo a mi manera y me aseguro de seguir evolucionando el conocimiento que otras personas me transmitieron. ",
    "about.AboutEducation2":" ",
    
    "about.TitleExperience1":"Programador de app movil",
    "about.DateExperience1":"2019-2020 ",
    "about.PlaceExperience1":"MABU - Ciudad Juaréz, Chih. MX ",
    "about.DescriptionExperience1":"Fui el programador principal de la aplicación Casas de cambio Jrz., realice la programación full stack de la misma en el framework de Ionic en su version 5 con Angular y Firebase, desarrolle las herramientas de comunicación directa con las casas de cambio para poder añadirlas a la aplicación y estuve monitorizando el desempeño de la aplicación durante las primeras semanas del despliegue de la misma. ",
    "about.AboutExperience1":" ",

    "about.TitleExperience2":" ",
    "about.DateExperience2":" ",
    "about.PlaceExperience2":" ",
    "about.DescriptionExperience2":" ",
    "about.AboutExperience2":" ",

    "portfolio.title":"Proyectos",
    "portfolio.front":"Proyectos Front-End",
    "portfolio.back":"Proyectos Back-End",
    "portfolio.watch":"Ver detalles",
    "portfolio.link":"Ir al sitio",

    "portfolio.card.typeLabel":"Tipo de aplicacion: ",
    "portfolio.card.dateLabel":"Año de desarrollo: ",
    "portfolio.card.featuresLabel":"Caracteristicas: ",
    "portfolio.card.descriptionLabel":"Resumen: ",
    "portfolio.card.tecLabel":"Lenguajes y tecnologias usadas: ",

    "portfolio.ProjectTitle.portfolio":"Portafolio personal",
    "portfolio.ProjectDate.portfolio":"2021",
    "portfolio.ProjectFeatures.portfolio":"Modo oscuro/brillante, Multi-Idioma, PWA",
    "portfolio.ProjectTec.portfolio":"Javascript, NextJS, TailwindCSS",
    "portfolio.ProjectType.portfolio":"Web",
    "portfolio.ProjectDescription.portfolio":"Te encuentras ahora mismo en mi portafolio personal, justamente en la sección de detalles del mismo, hasta la fecha este ha sido el proyecto personal del que más orgulloso estoy por la cantidad de tiempo que le dedique a la investigación de cada aspecto del mismo, cuenta con tecnologías modernas indispensables en cualquier sitio web moderno, como el selector de tema Oscuro y Brillante, además de la increíble rapidez y comodidad que otorga el framework de NextJS a la hora de desarrollar y desplegar la aplicación, además cuenta con un increíble diseño responsivo orientado a pantallas móviles primero, lo cual permite que la experiencia sea optima en cualquier situación posible, también cuenta con la característica de ser una Aplicación Web Progresiva (PWA), lo cual permite al usuario instalar la página web en su dispositivo que utilice en ese momento al acceder a la página web. ",

    "portfolio.ProjectTitle.personalBlog":"Blog personal",
    "portfolio.ProjectType.personalBlog":"Web",
    "portfolio.ProjectDate.personalBlog":"2021",
    "portfolio.ProjectFeatures.personalBlog":"Autenticacion, Carga de imagenes",
    "portfolio.ProjectTec.personalBlog":"Javascript, React",
    "portfolio.ProjectDescription.personalBlog":"Este blog fue diseñado con React y Strapi, la intención del blog es compartir conocimientos y opiniones que tenga referente a ciertos temas de interés, tanto de programación, como entretenimiento, la facilidad que me otorga Strapi como CMS de Back-end, me permite orientarme más al desarrollo Front-end del mismo, contando con características como buscador de publicaciones, selector de categorías, entre otras muchas características que debería tener cualquier blog mínimamente decente, elegí usar Strapi debido a que quería usar un CMS para facilitarme la vida, ya que quería utilizar algo que no fuera Firebase debido a que quise pulir mis habilidades respecto al consumo de apis restful, y Wordpress sencillamente me pareció algo que no debí tomar en cuenta para un proyecto donde el Back-end y Front-end se trabajan por separado, a pesar de dar la opción de hacerlo, Strapi simplemente es mejor pues ya está diseñado para esto. ",

    "portfolio.ProjectTitle.ASMPC":"Assembly pc",
    "portfolio.ProjectType.ASMPC":"Escritorio",
    "portfolio.ProjectDate.ASMPC":"2019",
    "portfolio.ProjectFeatures.ASMPC":"SQL a profundidad",
    "portfolio.ProjectTec.ASMPC":"Java, SQL",
    "portfolio.ProjectDescription.ASMPC":"Este programa lo diseñe debido a que una de mis grandes pasiones es el hardware de computadora, no me gustaba nada la idea de que mis amigos malgastaran su dinero comprando componentes que no eran del todo compatibles con otros componentes y en muchos casos ni siquiera eran útiles, por lo tanto, siempre tenía que invertir una buena cantidad de mi tiempo para poder indicarles las mejores opciones costo/beneficio para sus necesidades, ya fueran profesionales o de ocio, el programa cuenta con selectores a prueba de fallos para asegurarse de que el usuario no pueda seleccionar ninguna pieza de hardware incompatible, siguiendo meticulosamente las especificaciones en orden de cada componente, ya sea sockets, consumo, o tamaño, además del precio. ",

    "portfolio.ProjectTitle.CDC":"Casas de cambio APP",
    "portfolio.ProjectType.CDC":"Movil",
    "portfolio.ProjectDate.CDC":"2019-2020",
    "portfolio.ProjectFeatures.CDC":"Actualizaciones en tiempo real",
    "portfolio.ProjectTec.CDC":"Javascript, Firebase",
    "portfolio.ProjectDescription.CDC":"Esta aplicación fue pensada para mejorar la calidad de vida de los residentes de la frontera México - Estados Unidos que viajan constantemente al país vecino para hacer sus compras, debido a que el cambio de divisas es un negocio enorme y que varía muy frecuentemente, a veces resulta muy difícil encontrar el lugar ideal para hacer el cambio, donde el usuario pierda menos dinero, por lo tanto, la idea principal de la aplicación es tener al alcance de un simple clic las actualizaciones en tiempo real de cada casa de cambio disponible y cercana al usuario, para que de esta manera pueda decidir dónde ir a cambiar su divisa, todo esto es posible gracias a que Firebase proporciona un servicio increíblemente veloz y a tiempo real, además de la tecnología hibrida que permitía hacer aplicaciones móviles tanto para Android como para IOS llamada Ionic, si bien hoy en día sin duda alguna elegiría una opción mucho menos problemática como React Native o Flutter, aprendí mucho gracias al desarrollo con esta y no me arrepiento en lo absoluto del resultado. ",

    "portfolio.ProjectTitle.ProductHunt":"Clon de Product Hunt",
    "portfolio.ProjectType.ProductHunt":"Web",
    "portfolio.ProjectDate.ProductHunt":"2021",
    "portfolio.ProjectFeatures.ProductHunt":"Buscador, NOSQL",
    "portfolio.ProjectTec.ProductHunt":"Javascript, NextJS, Firebase",
    "portfolio.ProjectDescription.ProductHunt":"Este clon de la página Product hunt forma parte de un curso de Udemy donde mejore muchísimo mis conocimientos sobre react, sin embargo el curso es algo viejo y desactualizado en esa parte, por lo cual ni siguiendo todos los pasos del instructor se consigue hacer que la aplicación funcione correctamente, se encuentra en esta sección como parte de mi experiencia ya que gran parte de la lógica la tuve que cambiar de la aplicación para hacer que funcione correctamente, aunque  no representa una gran demostración de mis conocimientos, sí que representa mi capacidad de buscar y arreglar errores por mi cuenta.",

    "portfolio.ProjectTitle.weather":"Clima",
    "portfolio.ProjectType.weather":"Web",
    "portfolio.ProjectDate.weather":"2021",
    "portfolio.ProjectFeatures.weather":"Consumo de Api, PWA",
    "portfolio.ProjectTec.weather":"Javascript, React",
    "portfolio.ProjectDescription.weather":"Este proyecto lo realice únicamente como practica debido a que quería mejorar mis habilidades sobre el consumo de apis restful pero al mismo tiempo me di cuenta que quería una aplicación de clima que fuera de acuerdo a mis necesidades cuando mirara el celular, los datos relevantes que a mí me gusta mirar y no tener que perder tiempo viendo datos irrelevantes, por lo tanto decidí hacerla PWA para poder instalarla y no tener que abrir el navegador cada que quisiera acceder a ella con un simple click y no tener que buscar mi ciudad constantemente.  ",

    "portfolio.ProjectTitle.chat":"Chat en tiempo real",
    "portfolio.ProjectType.chat":"Web",
    "portfolio.ProjectDate.chat":"2021",
    "portfolio.ProjectFeatures.chat":"Chat en vivo",
    "portfolio.ProjectTec.chat":"Javascript, React, Firebase",
    "portfolio.ProjectDescription.chat":"La intención de este chat es tratar de replicar el chat de la plataforma conocida como Twitch, o del chat en vivo de los directos de Youtube, donde cualquier persona con una cuenta pueda comentar lo que está ocurriendo en ese preciso momento, si bien no es una aplicación pensada para escalar mucho, la funcionalidad es lo que más me interesa ya que al no ser un proyecto grande, me interesa más la experiencia de hacer algo así, el uso de React ayudo muchísimo a las actualizaciones constantes gracias a su sistema de componentes y Firebase que ayuda al sistema de hacer un sistema en tiempo real y fácil de utilizar para cualquiera. ",
    
    "portfolio.ProjectTitle.blogphp":"Blog PHP",
    "portfolio.ProjectType.blogphp":"Web",
    "portfolio.ProjectDate.blogphp":"2019",
    "portfolio.ProjectFeatures.blogphp":"MVC, Buscador",
    "portfolio.ProjectTec.blogphp":"PHP",
    "portfolio.ProjectDescription.blogphp":"Este blog fue hecho únicamente como motivo de práctica mientras aprendía los conceptos de PHP, forma parte de un curso de PHP que tome de la plataforma Udemy, el motivo por el que se encuentra aquí es que le añadí algunas modificaciones a las consultas de base de datos y mejoras a la aplicación que eran completamente ajenas al curso, como local storage y reestructuración de archivos para pasarlo a MVC, lo cual me ayudo bastante a comprender el funcionamiento de PHP de forma interna, es un proyecto muy simple sin embargo me siento muy contento con las modificaciones ajenas al curso pues pude demostrarme a mí mismo que en efecto estaba aprendiendo el lenguaje y a su vez me ayudo a entender el entorno de wordpress.",
    
    "portfolio.ProjectTitle.ffxiv":"FFXIV QoL",
    "portfolio.ProjectType.ffxiv":"Web",
    "portfolio.ProjectDate.ffxiv":"2021",
    "portfolio.ProjectFeatures.ffxiv":"Buscador, Consumo de Api",
    "portfolio.ProjectTec.ffxiv":"Javascript, React",
    "portfolio.ProjectDescription.ffxiv":"Esta aplicación no es más que un capricho personal para maximizar mi eficiencia en el videojuego de Final Fantasy XIV, consiste en consumir la api del juego para poder tener a medida absolutamente cualquier objeto del juego que necesite crear dentro del mismo, ya sean materiales, locaciones e incluso precios de los materiales, el juego no cuenta con una aplicación oficial similar, así que decidí hacer la mía, ya que le dedico bastante tiempo a este videojuego que es mi favorito, pensé que podría utilizarlo para mejorar mis habilidades de programación a la vez que mejoraba mi eficiencia en el juego. ",
    
    "portfolio.ProjectTitle.taquero":"Taquero",
    "portfolio.ProjectType.taquero":"Escritorio",
    "portfolio.ProjectDate.taquero":"2017",
    "portfolio.ProjectFeatures.taquero":"OpenGL",
    "portfolio.ProjectTec.taquero":"C++",
    "portfolio.ProjectDescription.taquero":"Este fue el primer proyecto medianamente grande que desarrolle con la ayuda de amigos en la escuela, se diseñó un motor gráfico muy sencillo 2D con la ayuda de OpenGL para poder desarrollar el escenario y los personajes, es un proyecto extremadamente simple, sin embargo, los conceptos de la programación orientada a objetos llevados a mi pasatiempo favorito me fueron demasiado útiles a la hora de seguir progresando en mi carrera de programador.",
    
    "portfolio.ProjectTitle.apiLaravel":"Api Laravel",
    "portfolio.ProjectType.apiLaravel":"Web",
    "portfolio.ProjectDate.apiLaravel":"2021",
    "portfolio.ProjectFeatures.apiLaravel":"JWT, Autenticación, MySQL",
    "portfolio.ProjectTec.apiLaravel":"PHP",
    "portfolio.ProjectDescription.apiLaravel":"Esta api rest desarrollada en laravel es un Back-end orientado a un blog simple, pensé en utilizarlo para el portafolio personal, sin embargo al final lo descarte debido a que si bien me permite alojar la api en un servicio de hosting compartido muy barato, no quería que la lentitud del sistema le hiciera un cuello de botella a React, debido a que el Back-end no es mi especialidad y no le dedique tanto tiempo como quisiera, se quedó de una forma que no cumplía con mis propios estándares de calidad y lo acabe dejando, sin embargo es completamente funcional para su objetivo principal y aprendí muchísimo del mundo Back-end pues fue mi primera api rest. ",
    
    "portfolio.ProjectTitle.apiNode":"Api NodeJS",
    "portfolio.ProjectType.apiNode":"Web",
    "portfolio.ProjectDate.apiNode":"2021",
    "portfolio.ProjectFeatures.apiNode":"JWT, Autenticación, MongoDB",
    "portfolio.ProjectTec.apiNode":"Javascript, NodeJS, Express",
    "portfolio.ProjectDescription.apiNode":"Esta api rest está desarrollada usando NodeJS y Express, utilizando como base de datos no relacionales a MongoDB, fue mi primer acercamiento al MERN stack, quería aprender mucho más de JWT y ya que el objetivo era únicamente de aprender, le di un enfoque a blog simple donde pudiera aprender las bases de Express, NodeJS y MongoDB, al mismo tiempo que me metía en temas como autenticación y mejoraba mis habilidades de javascript. ",
    
    "portfolio.ProjectTitle.strapiBlog":"Backend Blog Strapi",
    "portfolio.ProjectType.strapiBlog":"Web",
    "portfolio.ProjectDate.strapiBlog":"2021",
    "portfolio.ProjectFeatures.strapiBlog":"Autenticación, Headless CMS",
    "portfolio.ProjectTec.strapiBlog":"Javascript, Strapi",
    "portfolio.ProjectDescription.strapiBlog":"Por motivos de practica con el Front-end, utilizar una api rest a medida significaba una pérdida de tiempo considerable, por lo que decidí utilizar un CMS para el Back-end, en este caso elegí Strapi ya que no tiene lado de Front-end, por lo tanto es mucho más sencillo para mi manipular los endpoints y poder conectar ambas partes para desarrollar la aplicación full stack, este Back-end es el Back-end del proyecto de blog personal que se encuentra en la sección de Front-end. ",
    
    "portfolio.ProjectTitle.test":"",
    "portfolio.ProjectType.test":"",
    "portfolio.ProjectDate.test":"",
    "portfolio.ProjectFeatures.test":"",
    "portfolio.ProjectTec.test":"",
    "portfolio.ProjectDescription.test":"",
    
    "about.popover.HTML":"HTML (Del inglés HyperText Markup Language) es el componente más básico de la Web. Define el significado y la estructura del contenido web.",
    "about.popover.CSS":"CSS es el lenguaje de estilos utilizado para describir la presentación de documentos HTML o XML y describe como debe ser renderizado el elemento estructurado en la pantalla, en papel, en el habla o en otros medios.",
    "about.popover.Javascript":"JavaScript es un lenguaje de programación interpretado, dialecto del estándar ECMAScript. Se define como orientado a objetos, ​ basado en prototipos, imperativo, débilmente tipado y dinámico.",
    "about.popover.Git":"Git es un software de control de versiones diseñado por Linus Torvalds, pensando en la eficiencia, la confiabilidad y compatibilidad del mantenimiento de versiones de aplicaciones cuando estas tienen un gran número de archivos de código fuente.",
    "about.popover.React":"React es una biblioteca Javascript de código abierto diseñada para crear interfaces de usuario con el objetivo de facilitar el desarrollo de aplicaciones en una sola página. Es mantenido por Facebook y la comunidad de software libre.",
    "about.popover.Tailwind":"Tailwind es un marco de trabajo CSS de utilidad, no viene con componentes predefinidos. En su lugar, Tailwind CSS opera en un nivel inferior y le proporciona un conjunto de clases de ayuda CSS. ",
    "about.popover.Bootstrap":"Bootstrap es una biblioteca multiplataforma o conjunto de herramientas de código abierto para diseño de sitios y aplicaciones web. Contiene plantillas de diseño con tipografía, formularios, botones, cuadros, menús de navegación y otros elementos de diseño basado en HTML y CSS, así como extensiones de JavaScript adicionales. ",
    "about.popover.Firebase":"Es una plataforma ubicada en la nube, integrada con Google Cloud Platform, que usa un conjunto de herramientas para la creación y sincronización de proyectos que serán dotados de alta calidad, haciendo posible el crecimiento del número de usuarios.",
    "about.popover.Rest API":"REST es un estilo de arquitectura software para sistemas distribuidos como la World Wide Web. El término se originó en el año 2000, en una tesis doctoral sobre la web escrita por Roy Fielding, uno de los principales autores de la especificación del protocolo HTTP y ha pasado a ser ampliamente utilizado por la comunidad de desarrollo.",
    "about.popover.SQL":"SQL es un lenguaje de dominio específico utilizado en programación, diseñado para administrar, y recuperar información de sistemas de gestión de bases de datos relacionales.",
    "about.popover.MongoDB":"Mongodb es un sistema de base de datos NoSQL, orientado a documentos y de código abierto. En lugar de guardar los datos en tablas, tal y como se hace en las bases de datos relacionales, MongoDB guarda estructuras de datos BSON con un esquema dinámico, haciendo que la integración de los datos en ciertas aplicaciones sea más fácil y rápida.",
    "about.popover.NodeJS":"Node.js es un entorno en tiempo de ejecución multiplataforma, de código abierto, para la capa del servidor basado en el lenguaje de programación JavaScript, asíncrono, con E/S de datos en una arquitectura orientada a eventos y basado en el motor V8 de Google.",
    "about.popover.Express":"Express es un marco de aplicación web de back-end para Node.js, lanzado como software gratuito y de código abierto bajo la licencia MIT. Está diseñado para crear aplicaciones web y API. Se le ha llamado el marco de servidor estándar de facto para Node.js.",
    "about.popover.GraphQL":"GraphQL es un lenguaje de consulta y manipulación de datos para APIs, y un entorno de ejecución para realizar consultas con datos existentes.​ GraphQL fue desarrollado internamente por Facebook en 2012 antes de ser liberado públicamente en 2015.​",
    "about.popover.VueJs":"Vue.js es un framework de JavaScript de código abierto para la construcción de interfaces de usuario y aplicaciones de una sola página. Fue creado por Evan You, y es mantenido por él y por el resto de los miembros activos del equipo central que provienen de diversas empresas como Netlify y Netguru.​",
    "about.popover.PHP":"PHP es un lenguaje de programación destinado a desarrollar aplicaciones para la web y crear páginas web, favoreciendo la conexión entre los servidores y la interfaz de usuario.",
    "about.popover.Laravel":"Laravel es un framework de código abierto para desarrollar aplicaciones y servicios web con PHP 5, PHP 7 y PHP 8. Su filosofía es desarrollar código PHP de forma elegante y simple, evitando el código espagueti. Fue creado en 2011 y tiene una gran influencia de frameworks como Ruby on Rails, Sinatra y ASP.NET MVC.​",
    "about.popover.Python":"Python es un lenguaje de programación interpretado cuya filosofía hace hincapié en la legibilidad de su código.​ Se trata de un lenguaje de programación multiparadigma, ya que soporta parcialmente la orientación a objetos, programación imperativa y, en menor medida, programación funcional.",
    "about.popover.Angular":"Angular es un framework para aplicaciones web desarrollado en TypeScript, de código abierto, mantenido por Google, que se utiliza para crear y mantener aplicaciones web de una sola página.",

    "test":"",
    "test2":""
}